"file.untitled" = "Sin título";

"menu.about" = "Acerca de RightClick+";
"menu.version" = "Versión %@";
"menu.plan.free" = "Plan: Gratis";
"menu.plan.monthly" = "Plan: Pro Mensual ✓ (%d días)";
"menu.plan.annual" = "Plan: Pro Anual ✓ (%d días)";
"menu.plan.lifetime" = "Plan: Pro Vitalicio ✓";
"menu.checkForUpdates" = "Buscar actualizaciones…";

"upgrade.title" = "Actualizar a Pro";
"upgrade.subtitle" = "Desbloquea todas las funciones de RightClick+";
"upgrade.feat1" = "✓  Cortar y pegar archivos en Finder";
"upgrade.feat2" = "✓  Formatos Office y Apple (docx, xlsx, pptx, pages…)";
"upgrade.feat3" = "✓  Funciones y actualizaciones futuras";
"upgrade.monthly" = "$1 / mes";
"upgrade.annual" = "$11 / año  (ahorra 58%)";
"upgrade.buy" = "Obtener Pro →";
"upgrade.key_placeholder" = "Clave de licencia  (XXXX-XXXX-XXXX-XXXX)";
"upgrade.activate" = "Activar";
"upgrade.cancel" = "Quizás después";

"license.activated" = "🎉 ¡Pro Vitalicio activado! Gracias.";
"license.activated_monthly" = "🎉 ¡Pro Mensual activado! %d días restantes.";
"license.activated_annual" = "🎉 ¡Pro Anual activado! %d días restantes.";
"license.invalid_format" = "Formato inválido. Usa XXXX-XXXX-XXXX-XXXX.";
"license.invalid_key" = "Clave no encontrada. Revisa tu correo.";
"license.expired" = "Tu licencia ha expirado. Por favor renuévala.";
"license.already_used" = "Esta clave ya está activa en otro equipo.";

"license.expiry.soon.title" = "Tu licencia expira en %d día(s)";
"license.expiry.soon.body" = "Renueva ahora para mantener todas las funciones Pro sin interrupciones.";
"license.expiry.today.title" = "Tu licencia expira hoy";
"license.expiry.today.body" = "Renueva ahora para no perder el acceso a las funciones Pro.";
"license.expiry.renew" = "Renovar →";
"license.expiry.dismiss" = "Recordarme después";

"onboarding.title" = "Bienvenido a RightClick+";
"onboarding.subtitle" = "Dos pasos rápidos para empezar";
"onboarding.step1.title" = "Activar la extensión de Finder";
"onboarding.step1.detail" = "Se abrirá una ventana del sistema. Marca la casilla junto a RightClick+ para activarla.";
"onboarding.step1.done" = "✓ Extensión de Finder activa.";
"onboarding.step2.title" = "Permitir Auto-Renombrar";
"onboarding.step2.detail" = "Concede acceso de Accesibilidad en Ajustes del Sistema para que los archivos nuevos estén listos para renombrar.";
"onboarding.step2.done" = "✓ Auto-renombrar activado.";
"onboarding.btn.step1" = "Paso 1: Activar extensión →";
"onboarding.btn.step2" = "Paso 2: Permitir renombrar →";
"onboarding.btn.done" = "Listo — Cerrar";
"onboarding.skip" = "Lo haré después";
